In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_csv('bank-full (1).csv',sep=';')
data

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

In [3]:
data.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [4]:
loan= data[['age', 'job', 'marital', 'education', 'default', 'balance', 'housing','loan','y']]

In [5]:
loan

,age,job,marital,education,default,balance,housing,loan,y
0,58,management,married,tertiary,no,2143,yes,no,no
1,44,technician,single,secondary,no,29,yes,no,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,no
3,47,blue-collar,married,unknown,no,1506,yes,no,no
4,33,unknown,single,unknown,no,1,no,no,no
...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,yes
45207,71,retired,divorced,primary,no,1729,no,no,yes
45208,72,retired,married,secondary,no,5715,no,no,yes
45209,57,blue-collar,married,secondary,no,668,no,no,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,no

In [6]:
loan.shape

(45211, 9)

In [7]:
loan.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
y            object
dtype: object

In [8]:
loan.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
y            0
dtype: int64

In [9]:
loan.describe(include='all')

,age,job,marital,education,default,balance,housing,loan,y
count,45211.000000,45211,45211,45211,45211,45211.000000,45211,45211,45211
unique,NaN,12,3,4,2,NaN,2,2,2
top,NaN,blue-collar,married,secondary,no,NaN,yes,no,no
freq,NaN,9732,27214,23202,44396,NaN,25130,37967,39922
mean,40.936210,NaN,NaN,NaN,NaN,1362.272058,NaN,NaN,NaN
std,10.618762,NaN,NaN,NaN,NaN,3044.765829,NaN,NaN,NaN
min,18.000000,NaN,NaN,NaN,NaN,-8019.000000,NaN,NaN,NaN
25%,33.000000,NaN,NaN,NaN,NaN,72.000000,NaN,NaN,NaN
50%,39.000000,NaN,NaN,NaN,NaN,448.000000,NaN,NaN,NaN
75%,48.000000,NaN,NaN,NaN,NaN,1428.000000,NaN,NaN,NaN
max,95.000000,NaN,NaN,NaN,NaN,102127.000000,NaN,NaN,NaN

In [10]:
loan['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [11]:
pd.pivot_table(data=loan,values='age', index='marital',columns='job',aggfunc='count')

job,admin.,blue-collar,entrepreneur,housemaid,management,retired,self-employed,services,student,technician,unemployed,unknown
marital,,,,,,,,,,,,
divorced,750,750,179,184,1111,425,140,549,6,925,171,17
married,2693,6968,1070,912,5400,1731,993,2407,54,4052,731,203
single,1728,2014,238,144,2947,108,446,1198,878,2620,401,68

In [12]:
from sklearn.preprocessing import LabelEncoder
encoded=LabelEncoder()

In [13]:
loan.head()

   age           job  marital  education default  balance housing loan   y
0   58    management  married   tertiary      no     2143     yes   no  no
1   44    technician   single  secondary      no       29     yes   no  no
2   33  entrepreneur  married  secondary      no        2     yes  yes  no
3   47   blue-collar  married    unknown      no     1506     yes   no  no
4   33       unknown   single    unknown      no        1      no   no  no

In [14]:
loan["job"] = encoded.fit_transform(loan["job"])
loan["marital"] = encoded.fit_transform(loan["marital"])
loan["education"] = encoded.fit_transform(loan["education"])
loan["default"] = encoded.fit_transform(loan["default"])
loan["housing"] = encoded.fit_transform(loan["housing"])
loan["loan"] = encoded.fit_transform(loan["loan"])
loan["y"] = encoded.fit_transform(loan["y"])

In [15]:
loan.head()

   age  job  marital  education  default  balance  housing  loan  y
0   58    4        1          2        0     2143        1     0  0
1   44    9        2          1        0       29        1     0  0
2   33    2        1          1        0        2        1     1  0
3   47    1        1          3        0     1506        1     0  0
4   33   11        2          3        0        1        0     0  0

In [16]:
X=loan.drop( labels="y",axis=1)
y=loan[['y']]

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.20,random_state=12)

In [18]:
from sklearn.linear_model import RidgeClassifier,LogisticRegression

In [19]:
log_model=RidgeClassifier()
lor=LogisticRegression()

In [20]:
lor.fit(X_train,y_train)

LogisticRegression()

In [21]:
log_model.fit(X_train,y_train)

RidgeClassifier()

In [22]:
y_pred_train=log_model.predict(X_train)

In [23]:
y_pred=lor.predict(X_train)

In [24]:
y_predtest=lor.predict(X_test)

In [25]:
y_pred_test=log_model.predict(X_test)

In [33]:
from sklearn.metrics import mean_absolute_error,mean_squared_error,confusion_matrix

In [27]:
mean_absolute_error(y_train,y_pred_train)

0.1172583499225835

In [28]:
mean_squared_error(y_train,y_pred_train)

0.1172583499225835

In [34]:
confusion_matrix(y_train,y_pred_train)

array([[31927,     2],
       [ 4239,     0]], dtype=int64)

In [29]:
mean_absolute_error(y_test,y_pred_test)

0.1161119097644587

In [30]:
mean_squared_error(y_test,y_pred_test)

0.1161119097644587

In [35]:
confusion_matrix(y_test,y_pred_test)

array([[7993,    0],
       [1050,    0]], dtype=int64)

In [31]:
mean_absolute_error(y_test,y_predtest)

0.11622249253566294

In [32]:
mean_squared_error(y_train,y_pred)

0.11739659367396593